In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
plt.style.use('ggplot')
plt.rc('patch', force_edgecolor=True,edgecolor='black')
plt.rc('hist', bins='auto')

In [3]:
from sklearn.metrics import mean_squared_error
from sklearn.model_selection import train_test_split

import tensorflow as tf
from keras import optimizers
from keras.utils import plot_model
from keras.models import Sequential, Model
from keras.layers.convolutional import Conv1D, MaxPooling1D
from keras.layers import Dense, LSTM, RepeatVector, TimeDistributed, Flatten, Dropout

from sklearn.preprocessing import Normalizer
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import RobustScaler

Using TensorFlow backend.

In [22]:
train = pd.read_csv('wrangled_data/training_post_wrangle_small.csv')

test_full = pd.read_csv('wrangled_data/testing_post_wrangle_small.csv')

test = test_full.loc[:,['ID', 'shop_id', 'item_id']]

In [23]:
features = ['date_block_num', 'mean_item', 'mode_item', 'item_name', 'item_category_id', 'item_category_name', 'shop_name']

target = ['item_cnt_month']

In [24]:
train.columns

Index(['ID', 'shop_id', 'item_id', 'year', 'month', 'item_cnt_month',
       'date_block_num', 'mean_item', 'mode_item', 'item_name',
       'item_category_id', 'item_category_name', 'shop_name'],
      dtype='object')

In [25]:
train.head()

,ID,shop_id,item_id,year,month,item_cnt_month,date_block_num,mean_item,mode_item,item_name,item_category_id,item_category_name,shop_name
0,0,5,5037,2013,2,0.0,1.0,0.382353,0.0,1195,19,11,3
1,0,5,5037,2013,1,0.0,0.0,0.382353,0.0,1195,19,11,3
2,0,5,5037,2013,6,0.0,5.0,0.382353,0.0,1195,19,11,3
3,0,5,5037,2013,3,0.0,2.0,0.382353,0.0,1195,19,11,3
4,0,5,5037,2013,4,0.0,3.0,0.382353,0.0,1195,19,11,3

In [26]:
test.head()

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268

In [27]:
test_full.head()

,ID,shop_id,item_id,month,year,date_block_num,mean_item,mode_item,item_name,item_category_id,item_category_name,shop_name
0,0,5,5037,11,2015,34,0.382353,0.0,1195,19,11,3
1,1,5,5320,11,2015,34,0.000000,0.0,1254,55,39,3
2,2,5,5233,11,2015,34,0.294118,0.0,1239,19,11,3
3,3,5,5232,11,2015,34,0.029412,0.0,1238,23,15,3
4,4,5,5268,11,2015,34,0.000000,0.0,1245,20,12,3

In [11]:
# dataset = pd.merge(test, train, on = ['item_id','shop_id'], how='left')

In [12]:
dataset.head()

,ID,shop_id,item_id,year,month,item_cnt_month,date_block_num,mean_item,mode_item,item_name,item_category_id,item_category_name,shop_name
0,0,5,5037,2013.0,2.0,0.0,1.0,0.382353,0.0,5036.0,19.0,19.0,5.0
1,0,5,5037,2013.0,1.0,0.0,0.0,0.382353,0.0,5036.0,19.0,19.0,5.0
2,0,5,5037,2013.0,6.0,0.0,5.0,0.382353,0.0,5036.0,19.0,19.0,5.0
3,0,5,5037,2013.0,3.0,0.0,2.0,0.382353,0.0,5036.0,19.0,19.0,5.0
4,0,5,5037,2013.0,4.0,0.0,3.0,0.382353,0.0,5036.0,19.0,19.0,5.0

In [13]:
dataset.isna().sum()

ID                         0
shop_id                    0
item_id                    0
year                  102838
month                 102838
item_cnt_month        102838
date_block_num        102838
mean_item             102838
mode_item             102838
item_name             102838
item_category_id      102838
item_category_name    102838
shop_name             102838
dtype: int64